{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "Whats up",
        "Hey",
        "greetings",
        "Hey there",
        "Howdy",
        "Hiya",
        "Hola",
        "Yo",
        "Hi there",
        "Good evening",
        "Hello there",
        "Good to see you",
        "Nice to meet you",
        "Pleased to meet you",
        "Good afternoon",
        "Good morning",
        "What's going on?",
        "What's new?",
        "How's it going?",
        "How are things?",
        "How's life?",
        "How's your day?",
        "How's your day going?",
        "How have you been?",
        "Long time no see",
        "It's been a while",
        "Nice to see you",
        "Great to see you",
        "Lovely to see you",
        "It's good to see you",
        "Good to have you here",
        "Glad to see you",
        "What's good?",
        "Hey, what's up?",
        "Hi, how are you doing?",
        "Hello, how are you doing?",
        "How's everything?",
        "How's everything going?",
        "Hey, how's it going?",
        "Hi, what's new?",
        "Hello, what's new?",
        "Hi, good to see you",
        "Hi, nice to meet you",
        "Hi, glad to meet you",
        "Hello, good to meet you",
        "Hi, pleased to meet you",
        "Hello, pleased to meet you",
        "What's happening?",
        "What's been happening?",
        "What's up with you?",
        "What are you up to?",
        "Hey, what are you up to?",
        "Hello, what are you up to?",
        "What's the good word?",
        "Hey, what's the good word?",
        "Hello, what's the good word?",
        "How's everything on your end?",
        "How's your day been so far?",
        "How's your week been so far?",
        "What have you been up to lately?",
        "Hey, how have you been?",
        "Hello, how have you been?",
        "Hi, long time no see",
        "Hello, long time no see",
        "Good to see you again",
        "Great to see you again",
        "Nice to see you again",
        "Long time no talk",
        "It's been too long",
        "It's nice to be here",
        "It's great to be here",
        "It's lovely to be here",
        "It's a pleasure to be here",
        "Good to be back",
        "Great to be back",
        "Nice to be back",
        "Good to be here",
        "Great to be here",
        "Nice to be here",
        "What's cooking?",
        "What's popping?",
        "How are things with you?",
        "How have things been with you?",
        "What's the latest?",
        "What's the latest with you?",
        "How's everything with you?",
        "How have you been doing?",
        "How's life been treating you?"
      ],
      "responses": [
        "Hello!",
        "Good to see you again!",
        "Hi there, how can I help?",
        "Hello, what can I do for you?",
        "Hi! How can I assist you today?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "cya",
        "See you later",
        "Goodbye",
        "I am Leaving",
        "Have a Good day",
        "bye",
        "cao",
        "see ya",
        "farewell",
        "take care",
        "adios",
        "See you soon",
        "I'll be back",
        "Bye bye",
        "Until next time",
        "Catch you later",
        "I'm off",
        "See you next time",
        "See you",
        "Later",
        "Goodnight",
        "See you around",
        "I'm out",
        "Peace out",
        "I'm heading out",
        "I'll catch you later",
        "Talk to you later",
        "See you in a bit",
        "I gotta go",
        "I have to go",
        "Time for me to go",
        "It was nice seeing you",
        "It was nice talking to you",
        "I must be going",
        "Until we meet again",
        "I'll see you soon",
        "Talk to you soon",
        "I'll talk to you later",
        "Catch you on the flip side",
        "I'll catch you on the flip side",
        "Keep in touch",
        "Be seeing you",
        "Cheerio",
        "I'm off now",
        "It's time for me to leave",
        "I should be going",
        "I need to leave",
        "It's time for me to head out",
        "I'm going now",
        "I'll see you later",
        "Goodbye for now",
        "I'll say goodbye now",
        "I should say goodbye",
        "Time for me to say goodbye",
        "It's time to say goodbye",
        "I have to say goodbye now",
        "I must say goodbye",
        "Time to go",
        "Time for me to go now",
        "It's time for me to go now",
        "I have to go now",
        "I must go now",
        "I'll be going now",
        "I'll go now",
        "I'm leaving now",
        "It's time for me to leave now",
        "I need to leave now",
        "I'll leave now",
        "I'm heading out now",
        "I'll head out now",
        "Goodbye and take care",
        "Goodbye and see you soon",
        "Goodbye, have a good day",
        "Goodbye, catch you later",
        "Goodbye, see you next time",
        "Goodbye, see you around",
        "Goodbye, talk to you later",
        "Goodbye, see you in a bit",
        "Goodbye, until next time",
        "Goodbye, until we meet again",
        "Goodbye, keep in touch",
        "Goodbye, be seeing you",
        "Goodbye, cheerio",
        "Goodbye for now, take care",
        "Goodbye for now, see you soon",
        "Goodbye for now, have a good day",
        "Goodbye for now, catch you later",
        "Goodbye for now, see you next time",
        "Goodbye for now, see you around",
        "Goodbye for now, talk to you later",
        "Goodbye for now, see you in a bit",
        "Goodbye for now, until next time",
        "Goodbye for now, until we meet again",
        "Goodbye for now, keep in touch",
        "Goodbye for now, be seeing you",
        "Goodbye for now, cheerio",
        "Catch you later, take care",
        "Catch you later, see you soon",
        "Catch you later, have a good day",
        "Catch you later, see you next time",
        "Catch you later, see you around",
        "Catch you later, talk to you later",
        "Catch you later, see you in a bit",
        "Catch you later, until next time",
        "Catch you later, until we meet again",
        "Catch you later, keep in touch",
        "Catch you later, be seeing you",
        "Catch you later, cheerio"
      ],
      "responses": [
        "Sad to see you go :(",
        "Talk to you later",
        "Goodbye!",
        "Have a great day!",
        "See you next time!",
        "Take care!"
      ]
    },
    {
      "tag": "Refund",
      "patterns": [
        "Can I get a refund on cancellation?",
        "What is the refund policy for online orders?",
        "Is there any way to get refunded while canceling my order?",
        "Do you offer refunds for canceled orders?",
        "How can I get a refund for my order?",
        "What is your refund policy?",
        "Can I expect a refund if I cancel my order?",
        "What happens if I cancel my order, will I get a refund?",
        "Do I get my money back if I cancel?",
        "What's your policy on refunds for cancellation?",
        "Is refund possible on cancellation?",
        "Can I get my money back if I cancel the order?",
        "Do you refund money on order cancellation?",
        "If I cancel my order, do I get a refund?",
        "Will I be refunded if I cancel my order?",
        "Can I request a refund?",
        "How does the refund process work?",
        "When will I receive my refund after cancellation?",
        "Is the refund immediate after canceling an order?",
        "I've canceled my order, when can I expect my refund?",
        "Can you walk me through the refund process?",
        "How long does it take to get a refund?",
        "I canceled my order, how can I apply for a refund?",
        "What's the procedure for getting a refund?",
        "Do I need to submit any form to request a refund?",
        "Are refunds for cancellations automatic or do I have to request them?",
        "Is there any circumstance where I could get a refund?",
        "What are the terms for a refund?",
        "Are there any conditions under which I could get a refund?",
        "What are the steps to apply for a refund?",
        "What should I do to get a refund?",
        "How do I claim a refund?",
        "Is there a time limit for applying for a refund?",
        "How much time do I have to apply for a refund after cancellation?",
        "Are there any fees deducted from the refund?",
        "Do you have a refund department I can contact?",
        "How do I contact your refund department?",
        "I am eligible for a refund, how do I get it?",
        "What is the process for refund approval?",
        "What documents do I need to provide for a refund?",
        "Can I get a refund if I cancel within 24 hours?",
        "How long does a refund take to process?"
      ],
      "responses": [
        "Online orders have a No-Refund Policy",
        "Refunds are not provided for canceled orders."
      ]
    },
    {
      "tag": "Status",
      "patterns": [
        "What's the status of my order?",
        "Can I know the status of my order?",
        "Where is my order?",
        "How can I track my order?",
        "Is my order on its way?",
        "Can you update me on my order status?",
        "How do I know if my order has been shipped?",
        "When will my order arrive?",
        "Has my order been dispatched?",
        "Do you have any updates on my order?",
        "What's the update on my order?",
        "Is my order being processed?",
        "Can I check my order status?",
        "Any updates on my order?",
        "What's happening with my order?",
        "Did my order ship yet?",
        "What's the ETA for my order?",
        "Where can I see the status of my order?",
        "Can you provide a tracking number for my order?",
        "Is there a way to know when my order will be delivered?",
        "Has my order left the warehouse?",
        "Is my order still in the warehouse?",
        "How long will it take for my order to arrive?",
        "Are there any updates on the delivery of my order?",
        "Can I get a status update on my order?",
        "Has my order been confirmed?",
        "What's the delivery status of my order?",
        "When was my order shipped?",
        "Can you give me the latest update on my order?",
        "Is there an expected delivery date for my order?",
        "Where is my package now?",
        "Do you have a tracking system for orders?",
        "How often is the order status updated?",
        "Is the delivery of my order delayed?",
        "Has my order left for delivery?",
        "When should I expect my order to be delivered?",
        "I would like to know the status of my order?",
        "Can you tell me when my order was dispatched?",
        "What's the current location of my order?",
        "What are the stages of order processing?",
        "When can I expect to receive my order?",
        "Has there been any progress on my order?",
        "What is the expected shipping time for my order?",
        "Is my order in transit?",
        "Are there any delays in my order delivery?",
        "How soon will my order be dispatched?",
        "What's the delivery timeline for my order?",
        "What's the processing status of my order?",
        "Has my order been processed yet?",
        "Can I expect my order soon?",
        "How will I know when my order is shipped?",
        "Can you confirm if my order is on its way?",
        "How long does it take to process an order?",
        "Is there an update on the shipping of my order?",
        "What's the estimated delivery date of my order?",
        "Is there any update on the delivery of my order?",
        "What's the tracking status of my order?"
      ],
      "responses": [
        "To check the status of your order, please go to the 'Check Status' tab in your app",
        "You can track the status of your order through our website or app"
      ]
    },
    {
      "tag": "Change_request",
      "patterns": [
        "Can I change my order?",
        "How do I change my order?",
        "Is it possible to modify my order?",
        "I want to make changes to my order",
        "Can I add or remove items from my order?",
        "I made a mistake on my order, can I change it?",
        "I need to edit my order, is that possible?",
        "How can I alter my order after it's been placed?",
        "I want to adjust my order",
        "Can I revise my order?",
        "Can I make changes to my order?",
        "I need to update my order",
        "I want to modify my order",
        "Can I adjust my order after it's been placed?",
        "I want to change something in my order",
        "I have to amend my order",
        "How to alter the order I just placed?",
        "What's the procedure to modify an order?",
        "Is there an option to change my order details?",
        "I need to switch an item in my order",
        "Can I exchange a product in my order?",
        "I want to swap an item from my order",
        "I'd like to revise my order, how can I do that?",
        "Can I update my order details?",
        "I have made an error in my order, can I correct it?",
        "Can I modify the products in my order?",
        "How to update the order I have placed?",
        "Can I make a change in my order after payment?",
        "Can you assist me in changing my order?",
        "Is it feasible to change my order after confirmation?",
        "Can I change my mind after placing an order?",
        "I need to remove an item from my order, can I do that?",
        "Can I update my shipping address for the order?",
        "I want to add more items to my order, can I do that?",
        "Can I alter the quantity of a product in my order?",
        "How do I edit my order details?",
        "I wish to change my order, what are the steps?",
        "Can I modify my order after it's been confirmed?",
        "Can I change the payment method for my order?",
        "Is there a way to edit my order?",
        "I have to update my order, what should I do?",
        "I made a mistake while placing the order, how can I rectify it?",
        "Can I modify the delivery address for my order?",
        "I need to change the size of an item in my order, is that possible?",
        "Can I update my order once it's been placed?",
        "What's the process to modify an existing order?",
        "Can I modify the color of the item in my order?",
        "Is there any possibility to alter my order?",
        "I need to switch the color of an item in my order, can I do that?",
        "Is it possible to make changes to an order after it has been confirmed?",
        "Can you help me update my order?",
        "What's the process to change an order?"
      ],
      "responses": [
        "Yes, you can change your order by calling our customer service line.",
        "To change your order, please call our customer service line and provide your order number.",
        "Yes, it is possible to modify your order. Please call our customer service line for assistance."
      ]
    },
    {
      "tag": "price",
      "patterns": [
        "How much does a medium pizza cost?",
        "What's the price of a large pizza?",
        "How much do I need to pay for a small pizza?",
        "Tell me the cost of a large pizza",
        "What will a medium pizza cost me?",
        "Can you tell me the price of your pizzas?",
        "How much does your pizza cost?",
        "What's the cost of a small pizza?",
        "Can you give me a price breakdown for your pizzas?",
        "What's the price range for your pizzas?",
        "What's the cost for an extra large pizza?",
        "How much do I have to pay for a veggie pizza?",
        "What's the price for a meat pizza?",
        "Can you tell me how much a cheese pizza cost?",
        "What is the cost of a pepperoni pizza?",
        "How much is a Margherita pizza?",
        "What would a Hawaiian pizza cost me?",
        "What's the price for a BBQ Chicken pizza?",
        "How much does a thin crust pizza cost?",
        "Can you tell me the price of a deep dish pizza?",
        "What is the cost of a gourmet pizza?",
        "How much is a stuffed crust pizza?",
        "What's the price for a family size pizza?",
        "How much do I need to pay for a gluten-free pizza?",
        "What's the cost of a vegan pizza?",
        "Can you give me a price breakdown for your specialty pizzas?",
        "What's the price for a single topping pizza?",
        "How much does a double topping pizza cost?",
        "Can you tell me the price of a triple topping pizza?",
        "What's the cost of an all toppings pizza?",
        "How much extra do toppings cost?",
        "Can you tell me the price for additional toppings?",
        "What's the cost for extra cheese?",
        "How much does a pizza with extra sauce cost?",
        "What is the price of a half-and-half pizza?",
        "What's the cost for a pizza with a side order?",
        "Can you tell me the price for a pizza and soda combo?",
        "What's the price for a pizza with garlic bread?",
        "How much does a pizza with a salad cost?",
        "Can you tell me the price of a meal deal?",
        "What's the cost of a pizza party pack?",
        "What is the price for bulk orders?",
        "Can you give me a price estimate for a party order?",
        "What's the price for a delivery order?",
        "How much does a pickup order cost?",
        "Can you tell me the price of a dine-in order?",
        "What's the price for a takeout order?"
      ],
      "responses": [
        "The price of a small pizza starts from $5, medium from $7, and a large pizza from $10. Please note prices may vary based on the toppings chosen."
      ],
      "context_set": ""
    },
    {
      "tag": "delivery",
      "patterns": [
        "Do you deliver?",
        "How long does delivery take?",
        "Is there a delivery fee?",
        "What is your delivery service?",
        "Can I get my order delivered?",
        "What are the delivery options?",
        "Do you offer home delivery?",
        "Can you deliver my order to my house?",
        "What's your delivery policy?",
        "What areas do you deliver to?",
        "Do you deliver to my area?",
        "Can I get my pizza delivered to my workplace?",
        "Is there a minimum order for delivery?",
        "Do you deliver late at night?",
        "What are your delivery hours?",
        "Do you offer express delivery?",
        "Can I track my delivery?",
        "How can I change my delivery address?",
        "Is there a delivery charge for late night orders?",
        "Can I get my order delivered right now?",
        "What is your policy on delayed deliveries?",
        "Do you offer free delivery?",
        "How far do you deliver?",
        "What is your delivery radius?",
        "Can I schedule a delivery?",
        "How do I arrange for a future delivery?",
        "Can I get a same-day delivery?",
        "Can I have my order delivered tomorrow?",
        "Do you offer contactless delivery?",
        "What safety measures are you taking for delivery?",
        "Can I pick up my order instead of delivery?",
        "Do you do curbside delivery?",
        "What is the process for delivery?",
        "Do I need to tip the delivery person?",
        "What if I'm not home for the delivery?",
        "Can I have my pizza delivered to a park?",
        "Can you deliver to a public place?",
        "Can I change the delivery time after placing the order?",
        "Do you offer bulk delivery?",
        "Do you do party delivery?",
        "How is the pizza packaged for delivery?",
        "How will my pizza stay hot during delivery?",
        "Do you have a guarantee on delivery time?",
        "Do you offer discounts on delivery orders?",
        "What are the payment options for delivery?",
        "Can I pay cash on delivery?",
        "Do you accept credit card on delivery?",
        "Can I pay online for my delivery?",
        "What is your policy on missed delivery?",
        "Can you re-deliver if I missed the delivery?",
        "Do you deliver during holidays?",
        "What is your delivery policy during bad weather?",
        "Do you deliver during special events?",
        "Do you deliver to hotels?",
        "Can you deliver to a different address?",
        "Do you do surprise deliveries?",
        "Can I send a pizza delivery to someone else?",
        "Can I cancel my delivery order?",
        "How do I contact the delivery person?",
        "What if my delivery order is wrong?",
        "What if my delivery order is incomplete?",
        "What if my delivery is late?",
        "Can I add instructions for the delivery person?",
        "How can I rate the delivery service?",
        "Can I provide feedback on the delivery?"
      ],
      "responses": [
        "Our delivery typically takes 30-45 minutes, there is a small delivery fee based on your location. You can rate it by filling the feedback form the driver will provide you with. You can pay online. We also offer contactless delivery. All deliveries have to be local zone."
      ],
      "context_set": ""
    },
    {
      "tag": "hours",
      "patterns": [
        "What are your hours?",
        "When are you open?",
        "What time do you close?",
        "What are your operating hours?",
        "Are you open on weekends?",
        "What are your times?",
        "What times do you operate at?",
        "times",
        "hours",
        "When do you open?",
        "When do you close?",
        "Are you open right now?",
        "What are your business hours?",
        "When can I come in?",
        "Are you open today?",
        "Do you have special hours for holidays?",
        "What are your hours on weekends?",
        "What are your hours on weekdays?",
        "What's your schedule?",
        "Are you open during lunch hours?",
        "Are you open late?",
        "What's your timing for dinner?",
        "Do you close early on any day?",
        "Are you open all day?",
        "What are your summer hours?",
        "What are your winter hours?",
        "Are you open on Sundays?",
        "Do you operate on national holidays?",
        "What's your timing during Christmas?",
        "What are your New Year's Eve hours?",
        "Do you have extended hours?",
        "Are you open on public holidays?",
        "Do you have morning hours?",
        "Are you open 24/7?",
        "What are your early bird hours?",
        "Are you open on Boxing Day?",
        "Do you close early on certain days?",
        "What are your breakfast hours?",
        "What are your lunch hours?",
        "What are your dinner hours?",
        "Do you have any special hours this week?",
        "When do you open in the morning?",
        "When do you close at night?",
        "Are you open on Thanksgiving?",
        "Are you open on Christmas Day?",
        "Are you open on New Year's Day?",
        "Do you have late night hours?",
        "Are you open on Easter?",
        "Do you open on Bank Holidays?",
        "Are you open during festive seasons?",
        "Are there any changes in your operating hours this week?",
        "Can you tell me your working hours?",
        "What time do you start serving dinner?",
        "What time do you start serving lunch?",
        "What are your brunch hours?",
        "What time do you start serving breakfast?",
        "Are you open during the afternoon?",
        "Are you open early in the morning?",
        "Do you have special hours for seniors?",
        "Do you have any special timings for today?",
        "What are your Sunday hours?",
        "What are your Saturday hours?",
        "What are your Friday night hours?",
        "What are your Monday hours?",
        "What are your Tuesday hours?",
        "What are your Wednesday hours?",
        "What are your Thursday hours?",
        "What are your holiday hours?",
        "What are your hours during lockdown?",
        "What are your hours during this pandemic?",
        "Are you open late on weekends?",
        "Are you open early on weekends?",
        "Are you open for breakfast?",
        "Are you open for lunch?",
        "Are you open for dinner?",
        "Are you open during the day?",
        "Are you open at night?",
        "What's the best time to visit?",
        "When is the least busy time to visit?",
        "When is the peak time at your place?",
        "Do you have happy hours?",
        "What time do happy hours start?",
        "What time do happy hours end?"
      ],
      "responses": [
        "Our hours of operation are from 11am to 10pm daily.",
        "We are open from 11am to 10pm every day.",
        "We close at 10pm every day."
      ],
      "context_set": ""
    },
    {
      "tag": "vegan",
      "patterns": [
        "Do you have vegan options?",
        "Is there a vegan pizza on your menu?",
        "Can I get a pizza without any dairy?",
        "Do you offer any vegan toppings?",
        "Are there any vegan choices?",
        "Do you serve vegan pizzas?",
        "Can you make a pizza with vegan cheese?",
        "What are your vegan options?",
        "Do you have any pizzas for vegans?",
        "Do you have dairy-free pizzas?",
        "Are there any meatless pizzas?",
        "Do you use vegan cheese?",
        "Are your crusts vegan?",
        "Do you have vegan sauces?",
        "What kind of vegan toppings can I choose?",
        "Do you have plant-based options?",
        "Can I get a vegan salad?",
        "Do you have any vegan desserts?",
        "Are there any vegan appetizers?",
        "Is your marinara sauce vegan?",
        "Can I get a vegan pizza with no cheese?",
        "Do you offer gluten-free vegan options?",
        "Do you have vegan and gluten-free pizzas?",
        "Are your vegan pizzas also soy-free?",
        "Can I get a vegan calzone?",
        "Do you offer vegan drinks?",
        "Can I get vegan sides with my pizza?",
        "Do you use vegan dough?",
        "Are your vegetable toppings fresh?",
        "Can you make a custom vegan pizza?",
        "Do you have any vegan specials?",
        "Can I order a vegan pizza online?",
        "Can I get a vegan pizza delivered?",
        "Can I have a vegan pizza with extra vegetables?",
        "What kind of vegan meats do you offer?",
        "Do you have vegan pepperoni?",
        "Do you have vegan sausage?",
        "Do you have vegan chicken?",
        "Are there any new vegan items on your menu?",
        "Can you recommend a popular vegan pizza?",
        "Can you substitute the cheese with vegan cheese?",
        "Do you serve vegan pasta?",
        "Can I have vegan cheese on any pizza?",
        "Do you have any vegan options for kids?",
        "Is your vegan cheese made from nuts?",
        "Are your vegan pizzas also nut-free?",
        "Do you have vegan personal pizzas?",
        "Do you offer whole wheat vegan pizza?",
        "Can I get a half-and-half vegan pizza?",
        "Can you make a vegan version of your special pizzas?",
        "Do you have vegan stuffed crust pizza?",
        "Is your pizza sauce vegan?",
        "Do you have a vegan menu?",
        "Do you have any vegan soups?",
        "Do you have vegan garlic bread?",
        "Are your olives vegan?",
        "Do you have vegan mushroom pizza?",
        "Are your vegan pizzas cooked separately?",
        "Are your vegetables organic?",
        "Do you have vegan buffalo chicken pizza?",
        "Do you have vegan BBQ chicken pizza?",
        "Do you have vegan Hawaiian pizza?",
        "Do you have vegan Margherita pizza?",
        "Do you have vegan thin crust pizza?",
        "Do you have vegan pan pizza?",
        "Do you have vegan deep dish pizza?",
        "Do you have vegan cauliflower crust pizza?",
        "Do you offer vegan carryout options?",
        "Do you offer vegan dine-in options?",
        "Can I get a vegan pizza with extra sauce?",
        "Do you have a vegan meal deal?",
        "Can I get a vegan family meal?",
        "Do you have vegan party size pizzas?",
        "Can I get a vegan pizza with a stuffed crust?",
        "Do you offer vegan deals or discounts?",
        "Can I use a coupon on a vegan pizza?",
        "Do you offer vegan loyalty rewards?",
        "Do you have a vegan loyalty program?",
        "Can I get a vegan pizza slice?",
        "Do you have vegan white sauce pizza?",
        "Do you have vegan Alfredo sauce pizza?",
        "Do you have vegan pesto pizza?",
        "Do you have vegan green pizza?",
        "Do you have vegan red pizza?",
        "Do you have vegan yellow pizza?",
        "Do you have vegan rainbow pizza?",
        "Do you have vegan spicy pizza?",
        "Do you have vegan sweet pizza?",
        "Do you have vegan savory pizza?",
        "Do you have vegan dessert pizza?",
        "Can I get a vegan pizza with extra toppings?",
        "Can I get a vegan pizza with half toppings?",
        "Do you have vegan breakfast pizza?",
        "Do you have vegan lunch pizza?",
        "Do you have vegan dinner pizza?",
        "Can I get a vegan pizza with no toppings?",
        "Do you offer vegan delivery deals?",
        "Can I get a vegan pizza for pickup?",
        "Can I get a vegan pizza for carryout?",
        "Can I get a vegan pizza for delivery?"
      ],
      "responses": [
        "Yes, we do have vegan options available. We offer a variety of vegan toppings and we can also make a pizza with vegan cheese on request."
      ],
      "context_set": ""
    },
    {
      "tag": "Menu",
      "patterns": [
        "Can you show me your menu?",
        "What's on your menu?",
        "Can I see your menu?",
        "What pizzas do you have on your menu?",
        "What are the items on your menu?",
        "I'd like to see your menu.",
        "Can you tell me what's on your menu?",
        "Do you have a menu I can look at?",
        "What do you have on your menu?",
        "Can you give me a brief about your menu?",
        "What are your pizza options?",
        "What types of pizzas are on your menu?",
        "Can I have a look at your menu?",
        "What special pizzas do you have?",
        "Can you send me your menu?",
        "Do you have a digital menu?",
        "What are your signature pizzas?",
        "What's the variety of pizzas you have?",
        "Can you tell me more about your pizzas?",
        "Can I have a detailed look at your menu?",
        "Are there any new items on your menu?",
        "What's your pizza menu?",
        "Do you have a kid's menu?",
        "What's on your dessert menu?",
        "What's on your drinks menu?",
        "Can I get a menu for the sides?",
        "Do you have a menu for the appetizers?",
        "What's on your lunch menu?",
        "What's on your dinner menu?",
        "Do you have a special menu for weekends?",
        "What's on your breakfast menu?",
        "What are your daily specials?",
        "What's on today's menu?",
        "Can I see your specials menu?",
        "What's on your seasonal menu?",
        "Do you have a holiday menu?",
        "What's on your late-night menu?",
        "What are your top-selling pizzas?",
        "What's your pizza of the month?",
        "Can I get a list of your pizzas?",
        "What's on your takeaway menu?",
        "Do you have a catering menu?",
        "Can I see your party menu?",
        "What are the options for pizza bases?",
        "What are the options for pizza sizes?",
        "What are the options for pizza sauces?",
        "What are the options for pizza cheeses?",
        "What are the options for pizza toppings?",
        "What are the vegetarian pizzas on your menu?",
        "What are the non-vegetarian pizzas on your menu?",
        "What's on your gluten-free menu?",
        "Do you have a separate menu for vegans?",
        "What's on your low-carb menu?",
        "Do you have a menu for dietary restrictions?",
        "Do you have a customized pizza menu?",
        "What are your pizza combo options?",
        "Do you have a family meal menu?",
        "What are the deals on your menu?",
        "What are the discounts on your menu?",
        "What are the offers on your menu?",
        "What's on your early bird menu?",
        "Do you have a brunch menu?",
        "Do you have a buffet menu?",
        "Do you have a set menu?",
        "Do you have a pre-fixe menu?",
        "Do you have a tasting menu?",
        "Do you have a create your own pizza menu?",
        "What's on your gourmet pizza menu?",
        "Do you have a thin crust pizza menu?",
        "Do you have a thick crust pizza menu?",
        "Do you have a stuffed crust pizza menu?",
        "Do you have a deep dish pizza menu?",
        "Do you have a flatbread pizza menu?",
        "Do you have a Neapolitan pizza menu?",
        "Do you have a Sicilian pizza menu?",
        "Do you have a Chicago-style pizza menu?",
        "Do you have a New York-style pizza menu?",
        "Do you have a California-style pizza menu?",
        "Do you have a Greek pizza menu?",
        "Do you have a Margherita pizza menu?",
        "Do you have a pepperoni pizza menu?",
        "Do you have a BBQ chicken pizza menu?",
        "Do you have a Hawaiian pizza menu?",
        "Do you have a veggie pizza menu?",
        "Do you have a meat lover's pizza menu?",
        "Do you have a four cheese pizza menu?",
        "Do you have a supreme pizza menu?",
        "Do you have a buffalo chicken pizza menu?",
        "Do you have a Philly cheesesteak pizza menu?",
        "Do you have a Mexican pizza menu?",
        "Do you have an Italian pizza menu?",
        "Do you have a French pizza menu?",
        "Do you have a Spanish pizza menu?",
        "Do you have a Chinese pizza menu?",
        "Do you have a Japanese pizza menu?",
        "Do you have a Thai pizza menu?",
        "Do you have an Indian pizza menu?"
      ],
      "responses": [
        "Our menu includes a variety of pizzas with a wide range of toppings. We have both traditional favorites like Margherita and Pepperoni, as well as unique offerings like BBQ Chicken and Veggie Supreme. We also offer options for vegan and gluten-free pizzas. All pizzas are available at small, medium and large sizes. For more details, you can check out our menu on our website."
      ],
      "context_set": ""
    },
    {
      "tag": "Thanks",
      "patterns": [
        "OK thank you",
        "OK thanks",
        "OK",
        "Thanks",
        "Thank you",
        "That's helpful",
        "Appreciate your help",
        "That's useful",
        "Thanks for the info",
        "Thanks for the information",
        "Appreciate it",
        "Thanks for helping",
        "Much appreciated",
        "Great, thanks",
        "Thanks a lot",
        "Thanks for your assistance",
        "Thanks for your help",
        "Great, thank you",
        "That was helpful",
        "I appreciate your help",
        "Thanks for the clarification",
        "Thanks for clearing that up",
        "Thank you for your help",
        "Thanks for the quick response",
        "Thank you for the update",
        "Thanks for your support",
        "Thank you for your assistance",
        "Thanks for your time",
        "That answers my question, thanks",
        "You've been very helpful, thank you",
        "Thanks for your prompt response",
        "Thanks for your response",
        "Thank you for responding so quickly",
        "Thanks for the help",
        "Thanks for assisting me",
        "Thank you for your time",
        "Thanks for explaining",
        "Thank you for explaining",
        "Thanks, you solved my issue",
        "Thank you, you solved my problem",
        "Thanks for resolving my issue",
        "Thank you for resolving my problem",
        "Thanks for taking care of that",
        "Thank you for taking care of this",
        "Thanks for taking the time to help me",
        "Thank you for taking the time to assist me",
        "Thanks for your guidance",
        "Thank you for your guidance",
        "Thanks for sorting this out for me",
        "Thank you for sorting this out for me",
        "Thanks for the assistance",
        "Thank you for the support",
        "Thanks, that's just what I needed",
        "Thank you, that's exactly what I was looking for",
        "Thanks, that works for me",
        "Thank you, that works perfectly",
        "Thanks for all your help",
        "Thank you for all your help",
        "Thanks for everything",
        "Thank you for everything",
        "Thanks, you've been great",
        "Thank you, you've been fantastic",
        "Thanks, you've been really helpful",
        "Thank you, you've been very helpful",
        "Thanks, you've been a great help",
        "Thank you, you've been a tremendous help",
        "Thanks, I appreciate your help",
        "Thank you, I appreciate your assistance",
        "Thanks, that was really helpful",
        "Thank you, that was very helpful",
        "Thanks, I found that really useful",
        "Thank you, I found that very useful",
        "Thanks, you've been so helpful",
        "Thank you, you've been so helpful",
        "Thanks, that's very kind of you",
        "Thank you, that's very kind of you",
        "Thanks, that's really nice of you",
        "Thank you, that's really nice of you",
        "Thanks, I'm grateful for your help",
        "Thank you, I'm grateful for your help",
        "Thanks, you're a lifesaver",
        "Thank you, you're a lifesaver",
        "Thanks, you're the best",
        "Thank you, you're the best",
        "Thanks, you're a star",
        "Thank you, you're a star",
        "Thanks, you're a gem",
        "Thank you, you're a gem",
        "Thanks, you're a legend",
        "Thank you, you're a legend"
      ],
      "responses": [
            "No problem!",
            "Happy to help!",
            "Any time!",
            "My pleasure"
      ]
    }

  ]
}